#####################################################
## День 2. Тема урока: тип данных NoneType          #
#####################################################


## Пустое значение
#-----------------

# Во многих языках программирования (Java, C++, C#, JavaScript и т.д.) существует ключевое слово null, которое можно присвоить 
# переменным. Концепция ключевого слова null заключается в том, что оно дает переменной нейтральное или "нулевое" поведение.

# В языке Python, слово null заменено на None, поскольку слово null звучит не очень дружелюбно, а None относится именно к 
# требуемой функциональности – это ничего и не имеет поведения.


## Литерал None
#--------------

# Литерал None в Python позволяет представить null переменную, то есть переменную, которая не содержит какого-либо значения. 
# Другими словами, None – это специальная константа, означающая пустоту. Если более точно, то None – это объект специального типа 
# данных NoneType.