## Задача №1

# Используя списочный метод append(), дополните приведенный ниже код так, чтобы список list1 имел вид:

# list1 = [10, 20, [300, 400, [5000, 6000, 7000], 500], 30, 40]

list1 = [10, 20, [300, 400, [5000, 6000], 500], 30, 40]

list1[2][2].append(7000)

print(list1)


## Задача №2

# Используя списочный метод extend(), дополните приведенный ниже код так, чтобы список list1 имел вид:

# list1 = ['a', 'b', ['c', ['d', 'e', ['f', 'g', 'h', 'i', 'j'], 'k'], 'l'], 'm', 'n']

                  
# Подсписок для расширения  sub_list = ['h', 'i', 'j'].


list1 = ['a', 'b', ['c', ['d', 'e', ['f', 'g'], 'k'], 'l'], 'm', 'n']
sub_list = ['h', 'i', 'j']

list1[2][1][2].extend(sub_list)

print(list1)


## Задача №3

# Используя цикл for и встроенную функцию max(), дополните приведенный ниже код так, чтобы он выводил 
# максимальный элемент среди всех элементов вложенных списков списка list1.


list1 = [[1, 7, 8], [9, 7, 102], [6, 106, 105], [100, 99, 98, 103], [1, 2, 3]]
maximum = list()

for i in list1:
    maximum.append(max(i))


print(max(maximum))


## Задача №4

# Дополните приведенный ниже код так, чтобы список list1 имел вид:

# list1 = [[8, 7, 1], [102, 7, 9], [105, 106, 102], [103, 98, 99, 100], [3, 2, 1]]

list1 = [[1, 7, 8], [9, 7, 102], [102, 106, 105], [100, 99, 98, 103], [1, 2, 3]]

for i in list1:
    i.reverse()


print(list1)