# Задача 4
# Больше среднего

# Напишите программу, которая выводит количество элементов квадратной матрицы в каждой строке, больших среднего арифметического 
# элементов данной строки.

# Формат входных данных
# На вход программе подается натуральное число n – количество строк и столбцов в матрице, затем элементы матрицы (целые числа) 
# построчно через пробел.

# Формат выходных данных
# Программа должна вывести n чисел – для каждой строки количество элементов матрицы, больших среднего арифметического элементов данной 
# строки.


