#-------------------------------------
# Задача №3

# След матрицы ↘️
# Следом квадратной матрицы называется сумма элементов главной диагонали. Напишите программу, которая выводит след заданной квадратной матрицы.

# Формат входных данных
# На вход программе подается натуральное число n – количество строк и столбцов в матрице, затем элементы матрицы (целые числа) 
# построчно через пробел.

# Формат выходных данных
# Программа должна вывести одно число – след заданной матрицы.

# Вариант 2

# n = int(input('Enter your count of rows: '))

matrix = []

# sum_of_num = 0

