import random
import time

UPPER_RUS_ALPHABET = 'АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ'

LIST_OF_WORDS = ['КЛЮЧ', 'КНИГА', 'ЕНОТ', 'МАШИНКА', 'КОРОВА', 'ТЕЛЕЖКА', 'ШЛЕМ', 'КНОПКА', 'ШНУР', 'ЧЕРНЫЙ', 
'ВЛАСТЕЛИН', 'СКАЙП', 'ДУБ', 'ЧАСЫ', 'ТРУБА', 'ЕЛКА', 'ИНСТИТУТ', 'КОРОБКА', 'ТАБЛИЧКА', 'ВОДА', 'СКОВОРОДА', 
'МНОГОНОЖКА', 'ЕВРЕЙ', 'ТЕРМИТ', 'КАЧЕК', 'РУЛОН', 'МАГНИТОФОН', 'НОГА', 'СЛОН', 'МИКРОВОЛНОВКА', 'ТОРТ', 'МАК', 
'ДЫМ', 'ЧАЙКА', 'ВАЛЕТ', 'ПЛИНТУС', 'ШАПКА', 'ДИНОЗАВР', 'ТОРШЕР', 'БАЛАЛАЙКА', 'БАНКА', 'ЯХТА', 'ОВЦА', 'БАНАН', 
'ДУБ', 'АНИМЕ', 'РАДУГА', 'БУКВА', 'ВЕЛОСИПЕД', 'БАНДЖО', 'ГОЛУБЬ', 'ВИНТОВКА', 'КУБОК', 'ЖАСМИН', 'ТЕЛЕФОН', 
'АНДРОИД', 'ГОРА', 'ХАЛАТ', 'ЖЕТОН', 'ОБОД', 'МЫЛО', 'ЙОГ', 'ШИШКА', 'ДОЛЛАР', 'КОЛОНКА', 'КУБИК', 'ОМАР', 
'РАКЕТА', 'МОРКОВКА', 'ЗЕРКАЛО', 'МОЛОТ', 'ВОЗДУХ', 'ЗМЕЙ', 'ЁЖ', 'ПАЛЬМА', 'МАСЛО', 'ДИДЖЕЙ', 'МЕШОК', 'ТЮБИК', 
'МОЗГ', 'ПОЕЗД', 'РОЗЕТКА', 'ПАРАШЮТИСТ', 'БЕЛКА', 'ШПРОТЫ', 'САМОСВАЛ', 'ПАЗЛ', 'БУТЫЛКА', 'КРЕМЛЬ', 'ПИЦЦА', 
'МАКАРОНЫ', 'КОВЕР', 'ЗУБЫ', 'ЯРЛЫК', 'КАШАЛОТ', 'МАРС', 'ШАКАЛ', 'ПОМАДА', 'ДЖИП', 'ЛЕЩ', 'КАМЕНЬ', 'ДИСК']



def hangman_game(random_word):

    tries = 6
    count_of_letter = 0
    time.sleep(1)
    print("\nПриступим!")
    time.sleep(1)
    print(f"Используй следующий алфавит: {UPPER_RUS_ALPHABET}")
    time.sleep(1)
    print("Начальное положение висилицы: \n")
    print(                '''
                   --------
                   |      |
                   |      
                   |    
                   |      
                   |     
                   -
                ''')

    for i in range(1, tries + 1):
        some_letter = input("\nВведите букву, которая может быть в данном слове: ")
        if some_letter in UPPER_RUS_ALPHABET:
            if some_letter in random_word:
                count_of_letter = random_word.count(some_letter)
                print(f"Буква {some_letter} присутствует в слове {count_of_letter} раз")
            elif some_letter not in random_word:
                tries -= 1
                if tries == 5:
                    print(                '''
                   --------
                   |      |
                   |      O
                   |    
                   |      
                   |     
                   -
                ''')
                elif tries == 4:
                    print(                '''
                   --------
                   |      |
                   |      O
                   |      |
                   |      |
                   |     
                   -
                ''')
                elif tries == 3:
                    print(                '''
                   --------
                   |      |
                   |      O
                   |     \\|
                   |      |
                   |     
                   -
                ''')
                elif tries == 2:
                    print(                '''
                   --------
                   |      |
                   |      O
                   |     \\|/
                   |      |
                   |      
                   -
                ''')
                elif tries == 1:
                    print(                '''
                   --------
                   |      |
                   |      O
                   |     \\|/
                   |      |
                   |     / 
                   -
                ''')
                elif tries == 0:
                    print(                '''
                   --------
                   |      |
                   |      O
                   |     \\|/
                   |      |
                   |     / \\
                   -
                ''')
                    print("Ты проиграл!\n")
                    return False           
        else:
            time.sleep(1)
            print("\nБуква введена не верно!")
            print("Необходимо ввести заглавную русскую букву!")
            print(f"Вы ввели {some_letter}!")


random_word = random.choice(LIST_OF_WORDS).upper()
print(f"\nЗагаданное слово: {random_word}.")
hangman_game(random_word)