# # Google search - 2 🌶️🌶️

# На вход программе подаются натуральное число n, затем n строк, затем число k – количество поисковых 
# запросов, затем k строк – поисковые запросы. Напишите программу, которая выводит все введённые строки, 
# в которых встречаются одновременно все поисковые запросы.

# n = int(input("Enter your n: "))

# list_one = list()
# list_two = list()
# list_three = list()

# for i in range(n):

#     str_one = input("Enter your string: ")
#     list_one.append(str_one)

# num_k = int(input("Enter number of search queries: "))

# for i in range(num_k):

#     str_of_k = input("Enter strings (k): ")
#     list_two.append(str_of_k)


# print(list_one)
# print(list_two)